int/resources/objectRepo/xmlTemplates/opera/CashieringConfig/req_CreateTransactionCodes.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/mdm/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:CreateTransactionCodesRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:TransactionCodes>
            <v91:TransactionCode Code="?" CompTransaction="?" HotelCode="?">
               <v91:Classification>
                  <v91:Type/>
                  <v91:TransactionType Code="?" TaxCode="?"/>
                  <v91:Group Code="?" Description="?"/>
                  <v91:Subgroup Code="?" Description="?"/>
                  <v91:FiscalTransactionType/>
               </v91:Classification>
               <v91:Description>
                  <v91:DefaultText/>
                  <v91:TranslatedTexts>
                     <v91:Text Lang="?"/>
                  </v91:TranslatedTexts>
               </v91:Description>
               <v91:PaymentSetup PaymentType="?">
                  <v91:Usage AR="?" Cashier="?" Comp="?" Deposit="?" InterHotelDeposit="?" InterHotelPayment="?"/>
                  <v91:Card DisplayCode="?" InterfaceCode="?">
                     <v91:ProcessingType/>
                     <v91:AccountReceivable ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?">
                        <v91:Name/>
                        <v91:AccountNo/>
                     </v91:AccountReceivable>
                     <v91:Commission/>
                  </v91:Card>
                  <v91:IRS8300Reporting/>
                  <v91:RoundingFactor/>
                  <v91:GenerateTaxInvoice/>
               </v91:PaymentSetup>
               <v91:TrxSetup>
                  <v91:GeneratesType/>
                  <v91:TaxInclusive/>
                  <v91:Revenue/>
                  <v91:ManualPosting/>
                  <v91:UseForPaidout/>
                  <v91:RedeemMembershipPoints/>
                  <v91:IncludeInDepositRule/>
                  <v91:DepositPostingOnly/>
                  <v91:PostingRule/>
                  <v91:DepositType/>
                  <v91:CheckNoRequired/>
                  <v91:InterHotelSales/>
                  <v91:PostCovers/>
                  <v91:NonTaxable/>
                  <v91:Inactive/>
                  <v91:OwnershipStatus/>
               </v91:TrxSetup>
               <v91:AdjustmentCode/>
               <v91:ServiceRecoveryAdjustmentCode/>
               <v91:Amounts Currency="?">
                  <v91:DefaultPrice/>
                  <v91:MinAmount/>
                  <v91:MaxAmount/>
               </v91:Amounts>
               <v91:GeneratesSetup>
                  <v91:AddBaseAmtTo Bucket1="?" Bucket2="?" Bucket3="?"/>
                  <v91:Generates>
                     <v91:Generate Code="?" Description="?">
                        <v91:GenerateId ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/>
                        <v91:Rule>
                           <v91:Percentage Amount="?" CalculatedOn="?" UseTaxBracket="?"/>
                           <v91:FlatAmount Amount="?"/>
                           <v91:UDF/>
                           <v91:UDFFunctionName/>
                           <v91:UDFFunctionArguments>
                              <v91:FunctionArgument>
                                 <v91:Name/>
                                 <v91:Value/>
                                 <v91:Position/>
                                 <v91:DataType/>
                                 <v91:Required/>
                              </v91:FunctionArgument>
                           </v91:UDFFunctionArguments>
                           <v91:TaxTypeBased>
                              <v91:TaxType Code="?" Description="?">
                                 <v91:Schedule StartDate="?">
                                    <v91:Rule>
                                       <v91:Percentage Amount="?" CalculatedOn="?" UseTaxBracket="?"/>
                                       <v91:FlatAmount Amount="?"/>
                                       <v91:UDF>
                                          <v91:UDF/>
                                          <v91:UDFFunctionName/>
                                          <v91:UDFFunctionArguments>
                                             <v91:FunctionArgument>
                                                <v91:Name/>
                                                <v91:Value/>
                                                <v91:Position/>
                                                <v91:DataType/>
                                                <v91:Required/>
                                             </v91:FunctionArgument>
                                          </v91:UDFFunctionArguments>
                                       </v91:UDF>
                                       <v91:DoNotPost/>
                                       <v91:RoundingMethod/>
                                    </v91:Rule>
                                 </v91:Schedule>
                              </v91:TaxType>
                           </v91:TaxTypeBased>
                           <v91:RoundingMethod/>
                           <v91:Posting AdjustmentType="?" ApplicableDays="?"/>
                        </v91:Rule>
                        <v91:AddGeneratedAmtTo Bucket1="?" Bucket2="?" Bucket3="?"/>
                        <v91:Level/>
                     </v91:Generate>
                  </v91:Generates>
               </v91:GeneratesSetup>
               <v91:GLMapping>
                  <v91:ItemID/>
                  <v91:DepartmentCode/>
                  <v91:AccountCode/>
                  <v91:AccountDescription/>
                  <v91:CurrencyCode/>
                  <v91:StatCode/>
                  <v91:ProductCode/>
                  <v91:ChargeCode/>
                  <v91:AccountingCategory/>
               </v91:GLMapping>
               <v91:AssociatedTransactionCodes>
                  <v91:AssociatedTransactionCode Code="?" Description="?"/>
               </v91:AssociatedTransactionCodes>
               <v91:AllowServiceRecovery/>
               <v91:UniversalProductCode/>
               <v91:PrintTrxReceipt/>
            </v91:TransactionCode>
         </v9:TransactionCodes>
      </v9:CreateTransactionCodesRQ>
   </soapenv:Body>
</soapenv:Envelope>